# Sorting DataFrames with `.sort_values()`

### Import Pandas

In [1]:
# import pandas
import pandas as pd
from pathlib import Path

### Read CSV

In [4]:
path = Path('C:/Users/alouden01/Documents/python-pandas-for-data-manipulation/starter_files/skill_08_dataframe_sorting_ranking/mls_salaries.csv')
salaries = pd.read_csv(path)
salaries.head(3)

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0                2297000.0
1  ATL   Ambrose      Mikey        D      65625.0                  65625.0
2  ATL      Asad      Yamil        M     150000.0                 150000.0

### Head

In [ ]:
# called the head method

### Sort values

In [6]:
# sort values by first_name
salaries.sort_values("first_name").head()

     club  last_name first_name position  base_salary  guaranteed_compensation
177   HOU  DeLaGarza         AJ        D     250000.0                 252500.0
128   DAL    Guillen      Aaron        D      54075.0                  54075.0
430   PHI      Jones      Aaron        D      53004.0                  53004.0
373  NYRB       Long      Aaron        D      65000.0                  65000.0
486   RSL      Maund      Aaron        D     165000.0                 174437.5

### How is NaN sorted?
NaN is sorterd last by deafault, to change that, use na_position = "first"

### Sort by `club` then `base_salary`

In [7]:
# sort by club then base_salary
salaries.sort_values(['club','base_salary'])

,club,last_name,first_name,position,base_salary,guaranteed_compensation
19,ATL,Oblitey Otoo,Jeffrey,NaN,53000.00,53000.00
28,ATL,Walkes,Anton,D,53004.00,53004.00
29,ATL,Wheeler-Omiunu,Andrew,M,53004.00,53004.00
4,ATL,Carleton,Andrew,F,65000.00,77400.00
30,ATL,Williams,Romario,F,65000.00,65000.00
...,...,...,...,...,...,...
603,VAN,Reyna,Yordy,M-F,440000.04,533700.04
607,VAN,Shea,Brek,M-D,625000.00,670000.00
595,VAN,Laba,Matias,M,725000.00,885500.00
599,VAN,Montero,Fredy,F,1400000.04,1800000.04
613,NaN,NaN,NaN,NaN,NaN,NaN

### Sort by `club` then `base_salary`, descending

In [11]:
# sort by club then base_salary, descending

salaries.sort_values(['club','position','base_salary',],ascending=[True, True, False])

,club,last_name,first_name,position,base_salary,guaranteed_compensation
20,ATL,Parkhurst,Michael,D,325008.00,325008.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.00,285008.00
18,ATL,Mears,Tyrone,D,183756.00,183756.00
6,ATL,Garza,Greg,D,150000.00,150000.00
23,ATL,Robinson,Miles,D,125000.04,195000.04
...,...,...,...,...,...,...
597,VAN,McKendry,Ben,M,65000.00,65000.00
607,VAN,Shea,Brek,M-D,625000.00,670000.00
603,VAN,Reyna,Yordy,M-F,440000.04,533700.04
598,VAN,Mezquida,Nicolas,M-F,120000.00,120000.00
613,NaN,NaN,NaN,NaN,NaN,NaN

### Sort by `club` then `base_salary`, independently sorted

In [ ]:
# sort by club then base_salary, pasing a list of bools to sort clubs desc and base_salary asc

### Change the sorting of NaN values with `na_position=`

As you can see, the NaN values are in the beginning ⬆️

As you can see, the NaN values are in the end, or last ⬆️